In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                 columns=['col01','col02','col03'],
                 index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [3]:
import numpy as np

In [4]:
df = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]),
                 columns=['col01','col02','col03'],
                 index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [5]:
df.index

Index(['idx01', 'idx02', 'idx03'], dtype='object')

In [6]:
df.columns

Index(['col01', 'col02', 'col03'], dtype='object')

In [7]:
df = pd.DataFrame({'col01':[1,2,3],
                 'col02':[4,5,6],
                 'col03':[7,8,9]})


df

   col01  col02  col03
0      1      4      7
1      2      5      8
2      3      6      9

In [8]:
df = pd.DataFrame({'col01':[1,2,3],
                 'col02':[4,5,6],
                 'col03':[7,8,9]})

df.index=['idx01','idx02','idx03']
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [28]:
df = pd.DataFrame({'col01':[1,2,3],
                 'col02':[4,5,6],
                 'col03':[7,8,9]}
                  ,index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [10]:
df = pd.DataFrame([[1,2,3],
                 [4,5,6],
                 [7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [11]:
df.columns=['col01', 'col02', 'col03']
df.index=['idx01','idx02','idx03']

In [12]:
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [13]:
df.columns=['col04', 'col05', 'col06']

In [14]:
df

       col04  col05  col06
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [15]:
df = df.rename(columns={'col04':'x'})

In [16]:
df

       x  col05  col06
idx01  1      2      3
idx02  4      5      6
idx03  7      8      9

In [17]:
df.columns=['col04','col05','col06']
df

       col04  col05  col06
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [18]:
df = df.rename(columns={'col04':'x'})
df

       x  col05  col06
idx01  1      2      3
idx02  4      5      6
idx03  7      8      9

In [19]:
df = df.rename(columns={'col05':'y','col06':'z'})
df

       x  y  z
idx01  1  2  3
idx02  4  5  6
idx03  7  8  9

In [21]:
df = df.rename(index={'%who':'w'})
df

       x  y  z
w      1  2  3
idx02  4  5  6
idx03  7  8  9

In [22]:
df['x']

w        1
idx02    4
idx03    7
Name: x, dtype: int64

In [23]:
type(df['x'])

pandas.core.series.Series

In [24]:
df[['x']]

       x
w      1
idx02  4
idx03  7

In [25]:
type(df[['x']])

pandas.core.frame.DataFrame

In [29]:
df.loc['idx01']

col01    1
col02    4
col03    7
Name: idx01, dtype: int64

In [30]:
df.loc[:,'col01']

idx01    1
idx02    2
idx03    3
Name: col01, dtype: int64

In [32]:
df.iloc[:,0]

idx01    1
idx02    2
idx03    3
Name: col01, dtype: int64

In [33]:
df.loc['idx03','col02']

6

In [34]:
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [35]:
df.loc['idx03','col02']=100
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3    100      9

In [36]:
df.loc[:,'col03']=['Tokyo','Osaka','Hokkaido']
df

       col01  col02     col03
idx01      1      4     Tokyo
idx02      2      5     Osaka
idx03      3    100  Hokkaido

In [38]:
df.loc[:,'col02':'col03']

       col02     col03
idx01      4     Tokyo
idx02      5     Osaka
idx03    100  Hokkaido

In [41]:
df.iloc[:,1:3]

       col02     col03
idx01      4     Tokyo
idx02      5     Osaka
idx03    100  Hokkaido

In [42]:
df.index.get_loc('idx03')

2

In [43]:
df.columns.get_loc('col02')

1

In [45]:
df.iloc[df.index.get_loc('idx03'),df.columns.get_loc('col02')]=1000
df

       col01  col02     col03
idx01      1      4     Tokyo
idx02      2      5     Osaka
idx03      3   1000  Hokkaido

In [46]:
df.dtypes

col01     int64
col02     int64
col03    object
dtype: object

In [47]:
df.shape

(3, 3)

In [48]:
df=df.T

In [49]:
df

       idx01  idx02     idx03
col01      1      2         3
col02      4      5      1000
col03  Tokyo  Osaka  Hokkaido